mockingjay/artillery/apiRegister.yml
config:
  target: 'http://139.196.103.143:3000'
  phases:
    - duration: 1
      arrivalRate: 1
  processor: "./requesthook.js"
  defaults:
scenarios:
  - flow:
      - loop:
          - post:
              url: "/inventory/api/register"
              beforeRequest: "prepareApi"
              afterResponse: "logHeaders"
        count: 500